[
  {
    "id": "build_or_repair_roads",
    "type": "downtime_event",
    "name": "Build or Repair Roads Events",
    "events": [
      {
        "dice_value": "1",
        "description": "Before the roll, crews uncover an ancient road following the intended route, crafted with remarkable techniques that make it a sturdy base on which to build. The project gains an automatic breakthrough and the project goal is halved if it was not already halved."
      },
      {
        "dice_value": "2",
        "description": "After the roll, the local population grows in excitement with each completed section of the road. The name of the hero making the project roll spreads as a builder of bridges both literal and social. If the project roll is 12 or higher, the local community comes together to complete the project alongside the hero's hired crew. The hero doubles the renown earned at the end of the project."
      },
      {
        "dice_value": "3",
        "description": "Before the roll, a local religious or civic authority hears of the project and sends laborers to contribute as followers into the future favor. The hero gains an immediate 50 project points for the project if they accept the help."
      },
      {
        "dice_value": "4",
        "description": "After the roll, local hired hands and the project engineers find themselves at odds, hindering the project. If the hero can't help defuse the situation, the project requires an additional 50 project points to complete."
      },
      {
        "dice_value": "5",
        "description": "Before the roll, supply caravans are disrupted by bandits, requiring extra guards. If the hero can't deal with the bandit threat personally, the project requires an additional 50 project points to complete."
      },
      {
        "dice_value": "6",
        "description": "After the roll, word is heard that not everyone in the local area is happy about the road being built. The project is hindered by supernatural curses that cause stones to move, vines and overgrowth to reclaim sections already built, or churning earth to restore the road back to its previous form. The hero must make amends to the local supernatural community or have the renown earned by completing the project not exceed to that community."
      },
      {
        "dice_value": "7",
        "description": "After the roll, ditchers working on the project hit an ancient well, retaining wall, or hidden stream that results in an unexpected but positive deluge. At first, the new water source ultimately provides a boon to local farming communities. Project points earned by this roll are halved, but upon the project's completion, the hero earns 1 additional renown."
      },
      {
        "dice_value": "8",
        "description": "Before the roll, a new engineer arrives with specialist experience such as building aqueducts, bridge using ridge pumps or deep rainwater from slowing the work and so forth. They want to work on the project, but insist on receiving a considerable measure of the glory if they are hired. The project gets an automatic breakthrough."
      },
      {
        "dice_value": "9",
        "description": "Before the roll, the proposed road touches on a supernatural intersection—a crossing place between multiple worlds that draws interest from a powerful devil. The creature seeks to make the project even easier because the hero gains who offers to increase progress—but demands a future favor from the hero. If the deal is accepted, the project goal for the project is doubled until its completion."
      },
      {
        "dice_value": "10",
        "description": "After the roll, a guildmaster has it out for the hero. Whether from a past conflict or something about the way the project has unfolded, the guildmaster has made it so the hero's crew are targeted by dragons or have otherwise been harmed. The hero's renown is treated as 1 less than usual while these rumors persist."
      }
    ]
  },
  {
    "id": "crafting_and_research",
    "type": "downtime_event",
    "name": "Crafting and Research Events",
    "events": [
      {
        "dice_value": "01-02",
        "description": "After the roll, a thief who wants the project source or an item needed for the project approaches the hero and pretends to be someone who wants to help. The thief might want to steal the project source or item, or use it to undertake their same project at the hero."
      },
      {
        "dice_value": "03-04",
        "description": "Before the roll, a traveler in need of food, shelter, or some other necessary supplies upon the chance and asks for their help. If the heroes show kindness, the traveler reveals themselves to be an artisan or sage who can help with the project. The traveler can contribute one project roll to the project with a +3 modifier."
      },
      {
        "dice_value": "05-06",
        "description": "Before the roll, an NPC who is already friendly with the characters and has helped them before asks the hero to let them join the project. The NPC explains that they need the project source or the object being crafted as a personal matter of great importance (saving someone's life, atoning a great wrong and so forth). The NPC can contribute one project roll to the project with a +3 modifier, but the characters must consent to letting the NPC use the finished project before they can do so."
      },
      {
        "dice_value": "07-08",
        "description": "After the roll, the hero receives a mysterious note from a person who wants to exchange a treasure or other reward for the project source when the project is complete. The note suggests that what the hero is working on or making who wants to exploit what the hero is working on or something."
      },
      {
        "dice_value": "09-10",
        "description": "Before the roll, a pest starts devouring important components of the project. The cafeterita, bookbinding materials, magical components, metals acting as salts, mites devouring a prized project source, and so forth. If the pest isn't dealt with properly, all other components will need to be replaced."
      },
      {
        "dice_value": "11-12",
        "description": "Before the roll, a powerful supernatural entity sends an agent or personation to the hero, offering them knowledge that will let them complete the project immediately. In exchange, the hero must agree to do a favor for the entity, which might not be specified at the time of the bargain."
      },
      {
        "dice_value": "13-14",
        "description": "Before the roll, a rumor arises that the project is being worked on in service to an evil entity. People start showing up to the hero's place of respite, demanding that they report their wicked ways. If the rumors aren't disproved, locals form a mob to stop the project."
      },
      {
        "dice_value": "15-16",
        "description": "Before the roll, the hero's rival comes to visit and shows off a gift for the project. The rival is willing to hand the guide over—provided the hero publicly humiliates themselves by proclaiming that the rival is their better."
      },
      {
        "dice_value": "17-18",
        "description": "The project source is cursed. Before the roll, the hero must spend one land tenuation test or become obsessed with the project, that the project is complete. The hero can't use Victories to increase their Heroic Resources. The curse can be broken by slaying the creature who bestowed it, or by finding a priest to perform a holy ritual over the project source."
      },
      {
        "dice_value": "19-20",
        "description": "Before the roll, the hero finds that a significant amount of the project has been completed by a group of faeries. The faeries might have completed it as a lark or out of boredom, or they might want something from the hero in return."
      },
      {
        "dice_value": "21-22",
        "description": "After the roll, the hero realizes that the project source contains only half the information they need, and they must find the rest of the information to complete the project."
      },
      {
        "dice_value": "23-24",
        "description": "After the roll, the hero discovers a new bit of knowledge or a technique that allows them to immediately start and finish a second project with a project goal of 50 or lower."
      },
      {
        "dice_value": "25-26",
        "description": "Before the roll, the hero finds that someone has attempted to sabotage their project, resulting in damage to notes, the project source, or crafting components. The damage is repairable, but the creature hopes to strike again to worse effect if not discovered."
      },
      {
        "dice_value": "27-28",
        "description": "Before the roll, the project source is found to hold additional information, letting the hero treat the project roll as an automatic breakthrough. The note could have been left by a helpful visitor, or by someone who wants the hero's work to be finished for their own gain."
      },
      {
        "dice_value": "29-30",
        "description": "After the roll, the project flaws in a talent a devil who tries to subtly change the project source from the Seven Cities of Hell. If the hero doesn't notice, the devil is summoned the next time the hero makes a project roll, with goals of the Director's determination."
      },
      {
        "dice_value": "31-32",
        "description": "Before the roll, the hero stumbles upon a tool, page or book that helps them with the project, letting them treat the project roll as an automatic breakthrough."
      },
      {
        "dice_value": "33-34",
        "description": "After the roll, the project source suddenly becomes impossible to understand. A creature NPC has used a mighty power to obscure or corrupt the project source to prevent a potential catastrophe they foresee. If the heroes can help prevent the catastrophe a fraction away, the NPC will end the effect."
      },
      {
        "dice_value": "35-36",
        "description": "After the roll, the hero discovers that the project source contains a piece of helpful knowledge unrelated to the current project."
      },
      {
        "dice_value": "37-38",
        "description": "Before the roll, the hero learns that several sages working on similar projects have all mysteriously disappeared. Someone or something is abducting these experts for some nefarious purpose... and the hero could be next!"
      },
      {
        "dice_value": "39-40",
        "description": "After the roll, a group of scholars approaches the hero and asks to review the project source, promising to help the hero complete the project in return. If the hero accepts, the scholars take the project source and find out of the hero's next respite. Three of this scholars then contribute project rolls during the following respite, each with a +3 modifier."
      },
      {
        "dice_value": "41-42",
        "description": "After the roll, a physical project source or crafting components cease to life and attack the hero. The Magic within these items has become corrupted! If the hero can fix the corruption without destroying the items, the project is saved, but doing so requires a special ritual."
      },
      {
        "dice_value": "43-44",
        "description": "After the roll, an otherworldly specter appears and warns the hero not to complete the project, explaining that they died attempting the same project and are now attached to the project source. If the hero can convince the specter that their completion of the project will be better than the specter's, contributing one project roll to the project with a +3 modifier."
      },
      {
        "dice_value": "45-46",
        "description": "Before the roll, the remnants of a dragon appear and demand that the hero hand over the project source. If the hero refuses, the servants warn that the dragon will return to claim it through violence."
      },
      {
        "dice_value": "47-48",
        "description": "Before the roll, the hero notices a contract written on a physical project source or other accompanying materials that appear only under certain arcane rituals on the presence of magic, in the light of a full moon and so forth. The contract promises that anyone who signs it is locked well receive the true and full answer to three questions, in exchange for a week of service to the hag Corrine of Witesrang. The hag appears instantly if the contract is signed."
      },
      {
        "dice_value": "49-50",
        "description": "After the roll, an unexpected total eclipse of the sun occurs, lasting 1 hour. Once per respite when any creature makes another project roll for the project, they can treat that roll as an automatic breakthrough. Locals take this phenomenon as a sign of impending doom that will descend when the project is accomplished. Others believe that a powerful enemy is trying to scare the heroes into not finishing the project."
      },
      {
        "dice_value": "51-52",
        "description": "Before the roll, the hero gets a visit from an NPC who they helped in the past. The NPC has found a clue that relates to the project and gives it to the hero as gift of thanks."
      },
      {
        "dice_value": "53-54",
        "description": "After the roll, a local officer of the law appears and asks the hero to stop working on their project. The nature of the hero's project has become outlawed in the region, and the constable insists on stopping the project unless the hero gives in the ways."
      },
      {
        "dice_value": "55-56",
        "description": "Before the roll, the hero determines that the research or crafting they are planning requires only rare of their attention. They can either make two project rolls for their current project, or can make one project roll for another project."
      },
      {
        "dice_value": "57-58",
        "description": "After the roll, a component or tool the hero is using for the project suddenly reveals itself to be magic or pristine as it starts to burn with energy and glow red hot. If the item isn't quickly cooled, it explodes, and work on the project can't continue until a replacement is found."
      },
      {
        "dice_value": "59-60",
        "description": "Before the roll, the hero realizes they're at a critical point in the project, and can achieve more as they had. If they make 2 or more project rolls this respite, sleep, the character can make two project rolls for the project, but when they end the current respite, they do so with 1 fewer Recovery than usual."
      },
      {
        "dice_value": "61-62",
        "description": "Before the roll, a sage approaches the hero and offers to help with the project. This NPC isn't really a sage, however—they're an assassin hoping to catch the hero off guard."
      },
      {
        "dice_value": "63-64",
        "description": "Before the roll, a sage approaches the hero who helps with the project. This NPC isn't really a sage however—they're a bard who wishes to compose a song about the hero's deeds. The b is to imparter rhymed of to the hero while contributing nothing to the actual project."
      },
      {
        "dice_value": "65-66",
        "description": "After the roll, a physical project source or component of the project creates an unstable portal to another world related to the nature of the project. Tiny devils, imps, or other creatures emerge from the portal to the world they are of, but end causing mischief."
      },
      {
        "dice_value": "67-68",
        "description": "After the roll, the hero realizes that the project gains also holds information regarding the location of another project source or certain items, which are needed for another project the hero or one of their allies wants to pursue."
      },
      {
        "dice_value": "69-70",
        "description": "Before the roll, a group of enemies working for the campaign's villain attacks the hero, intent on destroying as much of the project source and equipment as possible."
      },
      {
        "dice_value": "71-72",
        "description": "Before the roll, a violent storm strikes the area where the hero is working on the project to completion. The closer to completion the hero gets on the project, the more violent the storm becomes. It's possible that the storm will end if someone is controlling the storm to stand in the hero's way."
      },
      {
        "dice_value": "73-74",
        "description": "After the roll, the hero falls asleep. They go on to complete the project in their dreams, but they have no access to their progress when they awake. The hero can rectify this by finding a way to physically enter into their dreams, where the completed project can be found."
      },
      {
        "dice_value": "75-76",
        "description": "Before the roll, a band of goblins barge in on the hero. If the hero has been fighting goblins on their recent adventures, the goblins attempt to run away with the project source. Otherwise, the goblins are merely curious about the project, and the hero can make two project rolls if they choose to explain it and have the goblins help."
      },
      {
        "dice_value": "77-78",
        "description": "After the roll, the hero watches as any progress made is reversed—as if the project were moving backward through time. Any character familiar with presence recognizes the phenomena as a chrono-anomaly. The project loses the minimum of progress each successive night until the hero finds and stops the source of the anomaly, which restores the project's progress."
      },
      {
        "dice_value": "79-80",
        "description": "Before the roll, the hero hears a voice beckoning them into the nearest wode to work on their project. Each time the hero makes a project roll in the wode, they make three times the progress but feel more pressure to stay in the wode forever."
      },
      {
        "dice_value": "81-82",
        "description": "After the roll, the hero stumbles upon knowledge of an expert a day's travel away who could complete the project, and who possesses a project source or guide for another hero's project."
      },
      {
        "dice_value": "83-84",
        "description": "Before the roll, fire rips through the hero's project source or other materials and threatens to destroy the entire project. If the hero puts out the fire before rolling, they find that the fire unlocked secret notes that let them make a subsequent project roll for the project."
      },
      {
        "dice_value": "85-86",
        "description": "After the roll, a suitor NPC approaches the hero and asks if they would like to make the project \"a little more exciting.\" If the hero agrees, the suitor narrates the hero's project more dramatically. For the rest of the project, if a project roll is lower than the first, the hero subtracts the second roll from the original roll. If it's equal or higher, the hero adds the second roll to the original roll."
      },
      {
        "dice_value": "87-88",
        "description": "Before the roll, the hero's rival reluctantly comes seeking the hero's help on their own project. If the hero agrees, the hero makes their project roll toward the rival's project, and the Director makes the rival's project roll toward the hero's project."
      },
      {
        "dice_value": "89-90",
        "description": "After the roll, the hero completes their work on the project earlier than expected and can either rejoicing with existing project points that are free. The hero and every character who joins them starts the next encounter with 1 temporary Stamina."
      },
      {
        "dice_value": "91-92",
        "description": "Before the roll, the hero is approached by a wagoner who needs help fixing their wagon. When the hero helps, they find out that the wagoner is allied with the campaign's villain. If the hero doesn't attack or threaten the wagoner, then in mind, the hero can choose to befriend or learn or relative of the wagoner. They leave the battle peacefully when they recognize the hero."
      },
      {
        "dice_value": "93-94",
        "description": "After the roll, the project source and any evidence of the project disappear into thin air. Any investigation of the area turns up footprints fleeing the scene and traces of dracal."
      },
      {
        "dice_value": "95-96",
        "description": "After the roll, the hero suddenly no longer understands or comprehends the project source after focusing on those materials for too long. If they continue with the project, they take a bane on its project rolls for the next two respites. Finally leave the project alone for the next two respites, they lose the to comprehend the research again, gaining an automatic breakthrough before the next project roll."
      },
      {
        "dice_value": "97-98",
        "description": "Before the roll, part of the hero's project source or other materials shrinks and is pulled through a mousehole. A group of rodentwords sent magical mice to steal the resource—or have them enchant themselves. The rodentwords are willing to negotiate if the hero doesn't approach them aggressively."
      },
      {
        "dice_value": "99-100",
        "description": "Before the roll, an elemental springs forth from the project source and pulls the hero into a duel. If the hero can survive 5 rounds of combat with the elemental on their own, the creature decides the hero has learned a completed the project. If the hero flees, falls unconscious, or gets help from an ally, the elemental destroys the project source as they disappear."
      }
    ]
  },
  {
    "id": "home_career_skills",
    "type": "downtime_event",
    "name": "Hone Career Skills Events",
    "events": [
      {
        "dice_value": "1",
        "description": "Before the roll, an old colleague from the hero's past asks the hero to give up adventuring and come back to their former career. A hero who reaffirms their intent to remain a hero gains a hero token. However, if they do so—or if they lie to stay they will return but have no intention—the goal renown their old career—the old colleague refuses to help them."
      },
      {
        "dice_value": "2",
        "description": "After the roll, the hero is hurt on the job. They end the respite with 1 fewer Recovery than usual."
      },
      {
        "dice_value": "3",
        "description": "Before the roll, the hero stumbles upon an individual seeking guidance about entering the same career as the hero. If the hero helps teach well to this NPC, the individual becomes one of the hero's followers, which they gain in addition to any gained through normal career rolls. The follower is an artisan or a sage depending on the hero's career, as the Director determines."
      },
      {
        "dice_value": "4",
        "description": "After the roll, the hero finds inspiration from their old life that helps out with a different career. If they are working on their second project on can immediately make a project roll for that project."
      },
      {
        "dice_value": "5",
        "description": "Before the roll, the hero stumbles into a negative aspect of their career that they forgot about or that they particularly find grueling. The project roll takes a bane this turn."
      },
      {
        "dice_value": "6",
        "description": "After the roll, the hero learns rumors of a treasure of the Director's choice that other members of the same career are seeking. If the hero doesn't seek the treasure ahead of time, they automatically determine where the treasure is found when they can complete that project."
      },
      {
        "dice_value": "7",
        "description": "Before the roll, a vaguely familiar stranger in the same career asks if they can work with the hero on their project. If the hero accepts their help, the stranger makes one project roll with a +2 modifier. However, the hero must later find out learn whether the stranger supports their motivation for working on the project or whether they work for the campaign's villain."
      },
      {
        "dice_value": "8",
        "description": "After the roll, the hero strangely feels 5 years younger. Any character familiar with timers recognizes the phenomena as a chrono-anomaly. The hero grows younger each time they make progress on the project—but will cease to exist if they complete the project without finding the cause of the anomaly."
      },
      {
        "dice_value": "9",
        "description": "Before the roll, the hero stumbles upon an old memento from when they worked their former career. They can choose between gaining an automatic breakthrough on the project roll or gaining a hero token."
      },
      {
        "dice_value": "10",
        "description": "After the roll, the hero gets back into the rhythm of their former career. They can make two additional project rolls."
      }
    ]
  },
  {
    "id": "learn_from_master",
    "type": "downtime_event",
    "name": "Learn From a Master Events",
    "events": [
      {
        "dice_value": "1",
        "description": "After the roll, the hero experiences a revelation and all their training snaps into place. The hero gains two additional project rolls this respite."
      },
      {
        "dice_value": "2",
        "description": "Before the roll, the master dies midway through training, or the lore they left behind is found to be incomplete. To complete the project, the hero must seek out another master who also has the lore by the first master, or find a master copy of the records of their teaching."
      },
      {
        "dice_value": "3",
        "description": "Before the roll, the hero discovers that although the master's knowledge is sound, they are less adept at the teaching of that knowledge. The project requires an additional 50 project points to complete."
      },
      {
        "dice_value": "4",
        "description": "Before the roll, the master requires the hero's aid with manual labor before their training can begin. The hero must spend this respite completing that labor, earning them future for their efforts and making a project roll."
      },
      {
        "dice_value": "5",
        "description": "Before the roll, the hero must undertake the master's grueling training regimen. The hero rolls and will for the project but roll under respiteness, but at the end of the respite, they regain 1 fewer Recoveries than usual."
      },
      {
        "dice_value": "6",
        "description": "After the roll, the hero's relationship with the master deepens. In addition to the current project, the master provides information relevant to the hero's goal, another project, or a surprising connection to a mystery from the hero's past."
      },
      {
        "dice_value": "7",
        "description": "Before the roll, the hero discovers that the master has been working with an enemy of the hero by covertly providing them information about the hero's activities. The master is remorseful about this secrecy, but learning from them themself and their allies in danger going so."
      },
      {
        "dice_value": "8",
        "description": "After the roll, an accident, fire, or other natural disaster disrupts the hero's training. The hero is called out for this problem but salvaged, but if the hero acts to stop the disaster, their heroism sets them earn 1 Renown."
      },
      {
        "dice_value": "9",
        "description": "Before the roll, the master gifts the hero with an item with a prerequisite for a crafting project."
      },
      {
        "dice_value": "10",
        "description": "After the roll, the hero uncovers a secret in their studies, something that the master had never anticipated or that their teachings hadn't covered. The project goal is halved."
      }
    ]
  },
  {
    "id": "community_service",
    "type": "downtime_event",
    "name": "Community Service Events",
    "events": [
      {
        "dice_value": "1",
        "description": "After the roll, the hero is recognized for their service. The local community spreads word of the hero's generosity, and the hero earns 1 additional Renown."
      },
      {
        "dice_value": "2",
        "description": "Before the roll, the hero stumbles upon a community problem that requires a different set of skills than they expected. The hero can choose to make a project roll for a different downtime project instead of Community Service this respite."
      },
      {
        "dice_value": "3",
        "description": "After the roll, the hero meets someone who was directly helped by their community service. This person becomes a follower of the hero, as determined by the Director."
      },
      {
        "dice_value": "4",
        "description": "Before the roll, the hero discovers that the community service work requires more effort than anticipated. The project roll takes a bane."
      },
      {
        "dice_value": "5",
        "description": "After the roll, the hero finds that the community work has given them insight into a local problem. They learn information about a treasure, villain's scheme, or mystery relevant to the campaign."
      },
      {
        "dice_value": "6",
        "description": "Before the roll, other volunteers join the hero in their community service work. The hero gains an automatic breakthrough for their project roll."
      },
      {
        "dice_value": "7",
        "description": "After the roll, the hero's work attracts the attention of a local authority figure who is impressed by their dedication. The hero gains a contact who can provide information or assistance in future adventures."
      },
      {
        "dice_value": "8",
        "description": "Before the roll, the hero encounters resistance from community members who are suspicious of outsiders. The hero must make a successful Presence test or the project roll fails this respite."
      },
      {
        "dice_value": "9",
        "description": "After the roll, the hero's community service uncovers evidence of corruption or wrongdoing by local officials. The hero must decide whether to investigate further or focus on their service work."
      },
      {
        "dice_value": "10",
        "description": "Before the roll, the hero finds an opportunity to teach their skills to community members. If they choose to do so, they complete their Community Service project immediately but gain no project points toward other downtime activities this respite."
      }
    ]
  },
  {
    "id": "fishing",
    "type": "downtime_event",
    "name": "Fishing Events",
    "events": [
      {
        "dice_value": "1",
        "description": "After the roll, the hero catches something unexpected—a message in a bottle, a piece of treasure, or a clue related to the campaign. The Director determines what the hero finds."
      },
      {
        "dice_value": "2",
        "description": "Before the roll, bad weather makes fishing difficult. The project roll takes a bane."
      },
      {
        "dice_value": "3",
        "description": "After the roll, the hero has an exceptional day of fishing and catches enough to feed a small community. The hero earns 1 additional Renown for their generosity."
      },
      {
        "dice_value": "4",
        "description": "Before the roll, the hero meets another angler who shares local fishing wisdom. The hero gains an automatic breakthrough for their project roll."
      },
      {
        "dice_value": "5",
        "description": "After the roll, the hero's fishing spot is disturbed by dangerous creatures. The hero must deal with the threat or find a new location for future fishing attempts."
      },
      {
        "dice_value": "6",
        "description": "Before the roll, the hero discovers their fishing gear is damaged or lost. The project roll fails this respite unless the hero spends gold to replace their equipment."
      },
      {
        "dice_value": "7",
        "description": "After the roll, the hero catches a rare or magical fish that could be sold for a good price or used as a component in alchemy or cooking. The hero gains a treasure of the Director's choice."
      },
      {
        "dice_value": "8",
        "description": "Before the roll, the hero encounters a territorial creature that guards the fishing waters. The hero must negotiate, fight, or find another way to gain access to the fishing spot."
      },
      {
        "dice_value": "9",
        "description": "After the roll, the hero's peaceful fishing attracts the attention of local wildlife that becomes friendly toward them. The hero gains an animal companion appropriate to the local environment."
      },
      {
        "dice_value": "10",
        "description": "Before the roll, the hero discovers that the fishing waters are connected to a larger mystery or supernatural phenomenon. The hero learns information relevant to the campaign but must decide whether to investigate further."
      }
    ]
  },
  {
    "id": "spend_time_with_loved_ones",
    "type": "downtime_event",
    "name": "Spend Time With Loved Ones Events",
    "events": [
      {
        "dice_value": "1",
        "description": "After the roll, the hero's time with loved ones is particularly meaningful and restorative. The hero regains 1 additional Recovery at the end of this respite."
      },
      {
        "dice_value": "2",
        "description": "Before the roll, the hero discovers that a loved one is in trouble or needs help. The hero must choose between focusing on their relationship or dealing with the crisis."
      },
      {
        "dice_value": "3",
        "description": "After the roll, the hero's loved one shares important information or gives them a meaningful gift. The hero gains a treasure, contact, or piece of information relevant to the campaign."
      },
      {
        "dice_value": "4",
        "description": "Before the roll, tension or conflict arises with a loved one due to the hero's dangerous lifestyle. The project roll takes a bane as the hero struggles with this emotional burden."
      },
      {
        "dice_value": "5",
        "description": "After the roll, the hero and their loved one create new happy memories together. The hero gains a hero token that they can use when protecting or helping their loved ones."
      },
      {
        "dice_value": "6",
        "description": "Before the roll, the hero's loved one expresses support and encouragement for the hero's adventures. The hero gains an automatic breakthrough for their project roll."
      },
      {
        "dice_value": "7",
        "description": "After the roll, the hero realizes their loved one has talents or knowledge that could be helpful in their adventures. The loved one offers to assist the hero in some way in the future."
      },
      {
        "dice_value": "8",
        "description": "Before the roll, the hero must deal with disapproval from family or friends about their adventuring lifestyle. The hero must make a successful Presence test or end this respite with 1 fewer Recovery than usual."
      },
      {
        "dice_value": "9",
        "description": "After the roll, the hero's loved one reveals they have been keeping a secret that could impact the hero's adventures. The nature of this secret is determined by the Director."
      },
      {
        "dice_value": "10",
        "description": "Before the roll, the hero has an opportunity to introduce their loved one to their adventuring companions. If they do so, it strengthens bonds between party members and the hero gains a hero token."
      }
    ]
  }
]
