[
  {
    "id": "hero_tokens_description",
    "type": "text",
    "description": "Earning Hero Tokens\n\nAt the start of a new game session, the heroes have a number of hero tokens equal to the number of heroes in the party.\n\nHeroes can earn more tokens through play by taking big risks to save others. A hero who leaps off a cliff to reach the bottom and aid a friend, who crosses a burning bridge to save a stray cat, or who wagers their most prized treasure as part of a negotiation to get shelter for a group of refugees might earn a hero token for the group. The Director has the final say regarding which heroic acts earn hero tokens.\n\nPlayers can also be awarded hero tokens as part of a test’s outcome when they succeed on the test with a reward.\n\nSpending Hero Tokens\n\nWhenever hero tokens are available, you can spend them in the following ways:\n\n- You can spend a hero token to gain 2 surges, allowing you to increase the damage or potency of an ability.\n- You can spend a hero token when you fail a saving throw, letting you succeed on the save instead.\n- You can spend a hero token to reroll a test. You must use the new roll.\n- You can spend 2 hero tokens on your turn or when you take damage (no action required) to regain Stamina equal to your recovery value before taking the damage.\n\nYou can use only one hero token benefit per turn or per test. Unless the Director decides otherwise, unused hero tokens disappear at the end of a session.\n\nOptional Rule: Hero Tokens Don’t Reset\n\nA Director can decide that hero tokens don’t refresh at the start of each session and don’t disappear at the end of one. This style of play serves many groups who play short sessions consisting of only 2 or 3 hours of play, since it makes hero tokens less abundant and reliable. To use this option, one of the players must note the number of hero tokens available at the end of each session so everyone remembers how many are available the next time you play. The Director should take particular care to remember to award hero tokens for heroic behavior, since the heroes won’t get any automatically"
  }
]
