[
  {
    "id": "feature_null_null_tradition",
    "type": "subclass",
    "name": "Null Tradition",
    "class": "null",
    "is_subclass_feature": true,
    "level": 1,
    "description": "Through extensive physical and psionic training, you have learned to unlock the full potential of your body. As you shape the growth of your power, you choose a null tradition from the following options, each of which grants you a skill. (*Quick Build:* Chronokinetic and the Monsters skill.)\n\nYour null tradition is your subclass, and your choice of tradition determines many of the features you'll gain as you gain new levels.",
    "options": [
      {
        "subclass_name": "Chronokinetic",
        "skill_group": "Lore",
        "description": " Your training unmoors you from temporal reality, allowing you to use the flow of time as another dimension that all things move through. You gain one skill from the lore group."
      },
      {
        "subclass_name": "Cryokinetic",
        "skill_group": "Crafting",
        "description": "You can tap into absolute cold, the most essential energy of myriad manifolds, and manifest its effects in your body. You gain one skill from the crafting group."
      },
      {
        "subclass_name": "Metakinetic",
        "skill_group": "Exploration",
        "description": "You learn to see through the illusions of the universe to more fully understand your body and its psionic potential. You gain one skill from the exploration group."
      }
    ]
  },
  {
    "id": "feature_null_discipline",
    "type": "heroic resource",
    "name": "Discipline",
    "class": "null",
    "level": 1,
    "description": "As your mastery of your body and tradition grows, it imbues you with a Heroic Resource called discipline.",
    "in_combat": {
      "name": "Discipline in Combat",
      "description": "At the start of a combat encounter or some other stressful situation tracked in combat rounds (as determined by the Director), you gain discipline equal to your Victories. At the start of each of your turns during combat, you gain 2 discipline.\n Additionally, the first time each combat round that an enemy in the area of your Null Field ability (see below) uses a main action, you gain 1 discipline. The first time each combat round that the Director uses an ability that costs Malice (see Draw Steel: Monsters), you gain 1 discipline.\n You lose any remaining discipline at the end of the encounter."
    },
    "out_of_combat": {
      "name": "Discipline Outside of Combat",
      "description": "Though you can’t gain discipline outside of combat, you can use your heroic abilities and effects that cost discipline without spending it. Whenever you use an ability or effect outside of combat that costs discipline, you can’t use that same ability or effect outside of combat again until you earn 1 or more Victories or finish a respite.\n  When you use an ability outside of combat that lets you spend unlimited discipline on its effect, you can use it as if you had spent an amount of discipline equal to your Victories. (Such abilities aren’t part of the core rules for the null, but they might appear in future products.)"
    }
  },
  {
    "id": "feature_null_discipline_mastery",
    "type": "feature",
    "name": "Discipline Mastery",
    "class": "null",
    "is_subclass_feature": true,
    "level": 1,
    "description": "As you advance in your chosen null tradition, you gain certain benefits in combat, including benefits based on the amount of discipline you have. Benefits based on how much discipline you have last until the end of your turn, even if a benefit would become unavailable to you because of the amount of discipline you spend during your turn. Some Discipline Mastery benefits can be applied only if you are a specific level or higher, with the level of those benefits noted in the tables below.",
    "grants": [
      {
        "subclass_name": "Chronokinetic",
        "description": " Whenever you use the Inertial Shield ability, you can use the Disengage move action as a free triggered action. Additionally, as your discipline grows, your psionic mastery of your body intensifies, granting benefits from the Chronokinetic Mastery table. Benefits are cumulative except where an improved benefit replaces a lesser benefit.",
        "load_additional_features": {
          "type": "table",
          "name": "discipline_mastery.json"
        }
      },
      {
        "subclass_name": "Cryokinetic",
        "description": " Whenever you use your Inertial Shield ability, you can then use the Grab maneuver as a free triggered action. Additionally, as your discipline grows, you strengthen the psionic power suffusing you, granting benefits from the Cryokinetic Mastery table. Benefits are cumulative except where an improved benefit replaces a lesser benefit.",
        "load_additional_features": {
          "type": "table",
          "name": "discipline_mastery.json"
        }
      },
      {
        "subclass_name": "Metakinetic",
        "description": " Whenever you use your Inertial Shield ability, you can then use the Knockback maneuver as a free triggered action. Additionally, as your discipline grows, your psionic potential is amplified, granting benefits from the Metakinetic Mastery table. Benefits are cumulative except where an improved benefit replaces a lesser benefit.",
        "load_additional_features": {
          "type": "table",
          "name": "discipline_mastery.json"
        }
      }
    ]
  },
  {
    "id": "feature_null_null_field",
    "type": "feature",
    "name": "Null Field",
    "class": "null",
    "level": 1,
    "description": "You project a psionic field of order around your body, dampening the effects of supernatural abilities harmful to you and your allies.",
    "ability": "Null Field"
  },
  {
    "id": "feature_null_inertial_shield",
    "type": "feature",
    "name": "Inertial Shield",
    "class": "null",
    "level": 1,
    "description": "Your instincts for danger let you predict attacks before they happen.",
    "ability": "Inertial Shield"
  },
  {
    "id": "feature_null_null_speed",
    "type": "feature",
    "name": "Null Speed",
    "class": "null",
    "level": 1,
    "description": "The flow of psionic power through you allows you to achieve high velocity. You gain a bonus to speed and to the number of squares you can shift when you take the Disengage move action equal to your Agility score.",
    "grants": [{ "speed_bonus": "Agility" }, { "disengage_bonus": "Agility" }]
  },
  {
    "id": "feature_null_psionic_martial_arts",
    "type": "feature",
    "name": "Psionic Martial Arts",
    "class": "null",
    "level": 1,
    "description": "Whenever you use the Knockback or Grab maneuver, you use Intuition instead of Might for the power roll and for determining if you can target creatures larger than you. Additionally, whenever you use the Knockback maneuver, you can choose to slide the target instead of pushing them."
  },
  {
    "id": "feature_null_tradition_feature_2",
    "type": "feature",
    "name": "Tradition Feature",
    "class": "null",
    "is_subclass_feature": true,
    "level": 2,
    "description": "You gain the 2th-level feature for your null tradition.",
    "grants": [
      {
        "subclass_name": "Chronokinetic",
        "name": "Rapid Processing",
        "description": "As a maneuver, you can read an entire book or process a similar amount of information. Additionally, during any respite, you can take an additional respite activity."
      },
      {
        "subclass_name": "Cryokinetic",
        "name": "Entropic Adaptability",
        "description": "You have cold immunity equal to twice your Intuition score. Additionally, you ignore difficult terrain related to cold and ice, and you can automatically climb at full speed while moving."
      },
      {
        "subclass_name": "Metakinetic",
        "name": "Inertial Sink",
        "description": "You add your Intuition score to your effective size for the purpose of interacting with creatures and objects, such as for determining whether you can lift an object, whether you are affected by forced movement, and so forth. This has no effect on whether you can be grabbed.\n\nAdditionally, when you fall, you reduce the effective height of the fall by 5 squares in addition to any other reductions. Whenever you take damage from being force moved, you reduce that damage by an amount equal to your level."
      }
    ]
  },
  {
    "id": "feature_null_psionic_leap",
    "type": "feature",
    "name": "Psionic Leap",
    "class": "null",
    "level": 3,
    "description": "You can long jump and high jump a distance equal to twice your Agility score without needing to make a test."
  },
  {
    "id": "feature_null_reorder",
    "type": "feature",
    "name": "Reorder",
    "class": "null",
    "level": 3,
    "description": "At the start of each of your turns, you can use a free triggered action to end one effect on you that is ended by a saving throw or that ends at the end of your turn. Alternatively, you can grant this benefit to one creature in the area of your Null Field ability."
  },
  {
    "id": "feature_null_discipline_mastery_improvement_2",
    "type": "feature",
    "name": "Discipline Mastery Improvement",
    "class": "null",
    "level": 4,
    "description": "Your Discipline Mastery feature provides additional benefits when you have 8 or more discipline."
  },
  {
    "id": "feature_null_enhanced_null_field",
    "type": "feature",
    "name": "Enhanced Null Field",
    "class": "null",
    "level": 4,
    "description": "While using your Null Field ability, you disrupt magic and psionic power suffusing the area around you. During combat, any temporary supernatural terrain effects of your level or lower are removed when your aura partially or fully overlaps with their location. Permanent supernatural terrain effects of your level or lower are temporarily negated while your aura overlaps with their location, but return when the aura no longer overlaps with them."
  },
  {
    "id": "feature_null_regenerative_field",
    "type": "feature",
    "name": "Regenerative Field",
    "class": "null",
    "level": 4,
    "description": "The first time each combat round that an enemy in the area of your Null Field ability uses a main action, you gain 2 discipline instead of 1."
  },
  {
    "id": "feature_null_tradition_feature_5",
    "type": "feature",
    "name": "Tradition Feature",
    "class": "null",
    "is_subclass_feature": true,
    "level": 5,
    "description": "You gain the 5th-level feature for your null tradition.",
    "grants": [
      {
        "subclass_name": "Chronokinetic",
        "name": "Instant Action",
        "description": "If you're not surprised at the start of your first turn in combat, you gain an edge on ability rolls and gain 2 surges. If you are surprised, you can spend 3 discipline to no longer be surprised and gain the benefits of this feature."
      },
      {
        "subclass_name": "Cryokinetic",
        "name": "Chilling Readiness",
        "description": "You steel yourself for imminent danger by tapping into your body's cold energy. At the start of any combat, you gain a number of surges equal to your Victories."
      },
      {
        "subclass_name": "Metakinetic",
        "name": "Inertial Fulcrum",
        "description": "Whenever you use an ability to reduce damage dealt to you or to reduce the distance of forced movement imposed upon you, you can deal damage to one enemy in the area of your Null Field ability equal to your Intuition score."
      }
    ]
  },
  {
    "id": "feature_null_elemental_absorption",
    "type": "feature",
    "name": "Elemental Absorption",
    "class": "null",
    "level": 6,
    "description": "Whenever you use your Inertial Shield triggered action, you gain immunity to acid, cold, corruption, fire, lightning, poison, and sonic damage equal to your Intuition score against the triggering damage."
  },
  {
    "id": "feature_null_elemental_buffer",
    "type": "feature",
    "name": "Elemental Buffer",
    "class": "null",
    "level": 6,
    "description": "Whenever you reduce acid, cold, corruption, fire, lightning, poison, or sonic damage with damage immunity, you gain 2 surges that can be used only to increase the damage of your next strike."
  },
  {
    "id": "feature_null_psi_boost",
    "type": "feature",
    "name": "Psi Boost",
    "class": "null",
    "level": 6,
    "description": "Whenever you use an ability that is a main action or a maneuver with the Psionic keyword, you can spend additional discipline to apply a psi boost to it and enhance its effects. A psi boost’s effects only last until the end of the turn which the ability is first used. You can apply multiple psi boosts to an ability, but only one instance of each specific boost. You can use the following psi boosts.",
    "load_additional_features": {
      "type": "table",
      "name": "psi_boost.json"
    }
  },
  {
    "id": "feature_null_discipline_mastery_improvement_3",
    "type": "feature",
    "name": "Discipline Mastery Improvement",
    "class": "null",
    "level": 7,
    "description": "Your Discipline Mastery feature provides additional benefits when you have 10 or more discipline."
  },
  {
    "id": "feature_null_improved_body",
    "type": "feature",
    "name": "Improved Body",
    "class": "null",
    "level": 7,
    "description": "When you gain discipline at the start of each of your turns during combat, you gain 3 discipline instead of 2."
  },
  {
    "id": "feature_null_tradition_feature_8",
    "type": "feature",
    "name": "Tradition Feature",
    "class": "null",
    "is_subclass_feature": true,
    "level": 8,
    "description": "You gain the 8th-level feature for your null tradition.",
    "grants": [
      {
        "subclass_name": "Chronokinetic",
        "name": "Shared Momentum",
        "description": "When you take the Disengage move action, one ally in the area of your Null Field ability can also take the Disengage move action as a free triggered action, using your distance for that move action."
      },
      {
        "subclass_name": "Cryokinetic",
        "name": "Synaptic Triage",
        "description": "As a free maneuver, you can spend 1d6 Stamina to remove one effect on you. Each creature of your choice in the area of your Null Field ability also gains this benefit."
      },
      {
        "subclass_name": "Metakinetic",
        "name": "Inertial Dampener",
        "description": "You and each creature or object of your choice in the area of your Null Field ability gain a bonus to stability equal to your Intuition score. A creature who attempts to force move a target with this bonus takes psychic damage equal to your Intuition score."
      }
    ]
  },
  {
    "id": "feature_null_i_am_the_weapon",
    "type": "feature",
    "name": "I Am the Weapon",
    "class": "null",
    "level": 9,
    "description": "Your Stamina increases by 21 and you can't be made bleeding even while dying. You no longer age or have need of food. Additionally, you can use Intuition instead of another characteristic when resisting potencies.",
    "grants": [{ "stamina_increase": 21 }, { "condition_immunity": "bleeding" }]
  },
  {
    "id": "feature_null_discipline_mastery_improvement",
    "type": "feature",
    "name": "Discipline Mastery Improvement",
    "class": "null",
    "level": 10,
    "description": "Your Discipline Mastery feature provides additional benefits when you have 12 or more discipline."
  },
  {
    "id": "feature_null_manifold_body",
    "type": "feature",
    "name": "Manifold Body",
    "class": "null",
    "level": 10,
    "description": "When you gain discipline at the start of each of your turns during combat, you gain 4 discipline instead of 3."
  },
  {
    "id": "feature_null_manifold_resonance",
    "type": "feature",
    "name": "Manifold Resonance",
    "class": "null",
    "level": 10,
    "description": "Your body becomes perfected matter, beyond the whims and chaos of the timescape and the restrictions of the manifolds. Each time you finish a respite, you can shift yourself and any creatures in the area of your Null Field ability to any location in the timescape known to you, known to any other creature in the area, or where any supernatural treasure in the area has been before.\n\nWhenever you use an ability, you gain 1 discipline that can be used only to apply a benefit from your Psi Boost feature to that ability. Additionally, you and allies in the area of your Null Field ability ignore banes and double banes on your power rolls."
  },
  {
    "id": "feature_null_order",
    "type": "feature",
    "name": "Order",
    "class": "null",
    "level": 10,
    "description": "You have an epic resource called order. Each time you finish a respite, you gain order equal to the XP you gain. You can spend order on your abilities as if it were discipline.\n\nAt the start of a combat encounter, you can spend 1 order to increase the size of your Null Field by 1 until the end of the encounter.\nOrder remains until you spend it."
  }
]
